ch3/exercise/UVa11809.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-09-29 六 22:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yb" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7012d72">1. UVa11809 - Floating-Point Numbers</a>
<ul>
<li><a href="#org736605e">1.1. 浮点数的表示知识点</a></li>
<li><a href="#orgde9fe24">1.2. 问题分析</a></li>
<li><a href="#org0b45890">1.3. 代码中不熟悉的地方</a>
<ul>
<li><a href="#org48a79d5">1.3.1. char *strcnpy(char *dst, char *src, size<sub>t</sub> len)</a></li>
<li><a href="#org6c9ac30">1.3.2. double atof(const char *str)</a></li>
<li><a href="#org0635a5f">1.3.3. char *strcpy(char *dst, char *src)</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org7012d72" class="outline-2">
<h2 id="org7012d72"><span class="section-number-2">1</span> UVa11809 - Floating-Point Numbers</h2>
<div class="outline-text-2" id="text-1">
<p>
原题链接为：<a href="https://uva.onlinejudge.org/index.php?option=com_onlinejudge&amp;Itemid=8&amp;page=show_problem&amp;category=830&amp;problem=2909&amp;mosmsg=Submission+received+with+ID+22045111">Floating-Point Numbers</a>。
大意为：对于给定的输入：AeB的形式，是一个十进制的浮点数，大小为A * 10<sup>B</sup>，输入保证这个浮点数的二进制表示全都为1，求这个二进制数的尾数M和阶码E。
</p>
</div>
<div id="outline-container-org736605e" class="outline-3">
<h3 id="org736605e"><span class="section-number-3">1.1</span> 浮点数的表示知识点</h3>
<div class="outline-text-3" id="text-1-1">
<p>
浮点数的表示形式为：0.X&times;2<sup>Y</sup>
</p>

<p>
其中，X和Y都是二进制的表示，而且，像科学计数法规定小数点前只包含一个个位数，这个二进制表示也强制规定小数点后第一位必须为1。
</p>

<p>
基于上面的规定，X将用M位尾码来表示，Y由E位阶码来表示。需要注意的是，由于小数点后第一位固定为1，为了节省空间（或者使得表现力更强），第一位便省略不写，故用来表示X实际上是由M+1位二进制数字。
举个例子：
0.111111111<sub>2</sub> &times; 2<sup>111111<sub>2</sub> </sup>
= 0.998046875 &times; 2<sup>63</sup>
= 9.205357638345294 &times; 10<sup>18</sup>
</p>

<p>
浮点数能够表达很大的数，最根本的原因就在与阶码的表示，一个32位的整数，最大只能表达2<sup>32</sup>-1的数，而对于浮点数，只需要6位阶码，就能表示X&times; 2<sup>63</sup>的数，X可以很接近1，可见，再多几位阶码，自然能够表达更大的数。
</p>
</div>
</div>

<div id="outline-container-orgde9fe24" class="outline-3">
<h3 id="orgde9fe24"><span class="section-number-3">1.2</span> 问题分析</h3>
<div class="outline-text-3" id="text-1-2">
<p>
看准输入和输出很重要。
原题中，指名了输入保证唯一解，而且保证0&le; M&le; 9，1&le; E&le; 30。数据如此之小，基本就在暗示打表了。
</p>

<p>
当然，此题的难点也就在这里显现了出来，如果说要计算这些M和E表示的数，是很容易溢出的（数字可达2<sup>2<sup>30</sup>-1</sup>，C++中double也仅有11位的阶码，而这里却可达30）。
</p>

<p>
于是，我自己在这里卡了很久，最后还是查了题解，不得不说，数学水平真的下降得太多了，基本的转化方法都想不起来，看来真的是需要多练习啊。
问题实际上是这样的：
</p>

<p>
给定了A&times; 10<sup>B这样的字串表示</sup>，要找到0.X&times;2<sup>Y与之相等</sup>，若是在以前，估计应该很快就能想到了吧，两边取对数即可，而现在，有点物是人非了。。。
取对数（以10为底，lg）
</p>

<p>
故就是要找到lg(A) + B == lg(0.X) + Ylg(2)，这里注意X和Y分别由M和E求得，然后通过计算lg的值进行打表，然后对输入的值进行遍历查询即可。
</p>
</div>
</div>

<div id="outline-container-org0b45890" class="outline-3">
<h3 id="org0b45890"><span class="section-number-3">1.3</span> 代码中不熟悉的地方</h3>
<div class="outline-text-3" id="text-1-3">
<p>
这个输入是AeB，题目保证A有15位小数，前两位为个位和小数点，因此需要对输入进行一点点的处理。
这里用到了几个函数：
</p>
</div>
<div id="outline-container-org48a79d5" class="outline-4">
<h4 id="org48a79d5"><span class="section-number-4">1.3.1</span> char *strcnpy(char *dst, char *src, size<sub>t</sub> len)</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
因为知道A的长度，故截取前面17位即可。但是需要注意的是，如果src长度度大于len时，dst末尾没有NUL，需要自己手动给最后一位赋0。
</p>
</div>
</div>

<div id="outline-container-org6c9ac30" class="outline-4">
<h4 id="org6c9ac30"><span class="section-number-4">1.3.2</span> double atof(const char *str)</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
字符数组转化为浮点数，当然类似的还有atoi()
</p>
</div>
</div>

<div id="outline-container-org0635a5f" class="outline-4">
<h4 id="org0635a5f"><span class="section-number-4">1.3.3</span> char *strcpy(char *dst, char *src)</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
后面的B的长度是不定的，故需要用到这个函数
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: yb</p>
<p class="date">Created: 2018-09-29 六 22:53</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
